---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.HasValidAlignedServer
source: html/7ada7359-1303-4a2e-d276-c93567f2bdce.htm
---
# Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.HasValidAlignedServer Method

Returns true if the current rebar is created with the Aligned Free Form rebar server, false otherwise.

## Syntax (C#)
```csharp
public bool HasValidAlignedServer()
```

## Returns
Returns true if the current rebar is created with the Aligned Free Form rebar server, false otherwise.